package com.haruhi.botServer.constant;

import lombok.AllArgsConstructor;
import lombok.Getter;

@Getter
@AllArgsConstructor
public enum HandlerWeightEnum {
    // 9开头 优先级最高 处理之后还需要继续往下传递
    W_999(999,"保存聊天记录"),
    W_990(990,"复读机"),

    W_890(890,"捏"),
    W_880(880,"千问"),
    W_870(870,"DeepSeek"),
    W_860(860,"显示所有功能"),
    W_820(820,"pixr根据tag"),
    W_780(780,"pix统计"),
    W_760(760,"识图"),
    W_750(750,"识番"),
    W_740(740,"pix根据tag"),
    W_700(700,"添加词条"),
    W_680(680,"词条监听"),
    W_660(660,"删除词条"),
    W_640(640,"本群词条"),
    W_600(600,"群聊天记录搜索"),
    W_570(570,"Jmcomic"),
    W_550(550,"赞我"),
    W_540(540,"群词云"),
    W_500(500,"弹幕词云"),
    W_485(485,"骂我"),
    W_470(470,"bt搜索"),
    W_460(460,"bt影视搜索"),
    W_450(450,"今日新番"),
    W_430(430,"朋友说"),
    W_400(400,"查看每日新闻"),
    W_380(380,"点歌"),
    W_370(370,"俄罗斯轮盘"),
    W_350(350,"上传日志"),
    W_330(330,"实时日志"),
    W_300(300,"查看状态"),
    W_270(270,"撅"),
    W_260(260,"跳"),
    W_250(250,"群聊记录统计"),
    W_233(233,"解析b站视频"),
    W_230(230,"导出群聊记录Excel"),
    W_210(210,"解析磁力链接"),
    W_200(200,"刷新缓存"),
    W_190(190,"重启BOT程序"),
    W_180(180,"自定义回复"),
    W_160(160,"智障聊天"),


    ;

    private int weight;
    private String name;
}
